{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"quantization": {"dtype": "uint8", "min": -4.40366377550013, "scale": 0.03311025395112879}, "dtype": "float32", "name": "dense_1/kernel", "shape": [32, 8586]}, {"quantization": {"dtype": "uint8", "min": -1.8583387150483972, "scale": 0.024451825198005227}, "dtype": "float32", "name": "dense_1/bias", "shape": [8586]}, {"quantization": {"dtype": "uint8", "min": -3.1803937865238567, "scale": 0.02427781516430425}, "dtype": "float32", "name": "lstm_1/kernel", "shape": [200, 128]}, {"quantization": {"dtype": "uint8", "min": -2.589106630811504, "scale": 0.022912448060278798}, "dtype": "float32", "name": "lstm_1/recurrent_kernel", "shape": [32, 128]}, {"quantization": {"dtype": "uint8", "min": -2.2910091185102277, "scale": 0.02141130017299278}, "dtype": "float32", "name": "lstm_1/bias", "shape": [128]}]}], "modelTopology": {"keras_version": "2.1.4", "model_config": {"config": [{"config": {"stateful": false, "unit_forget_bias": true, "implementation": 1, "kernel_constraint": null, "use_bias": true, "name": "lstm_1", "unroll": false, "dtype": "float32", "units": 32, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "return_state": false, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, null, 200], "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "units": 8586, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow", "training_config": {"metrics": ["sparse_categorical_accuracy"], "optimizer_config": {"config": {"momentum": 0.8999999761581421, "decay": 9.999999747378752e-05, "nesterov": true, "lr": 0.20000000298023224}, "class_name": "SGD"}, "loss_weights": null, "loss": "sparse_categorical_crossentropy", "sample_weight_mode": null}}}