{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 32, 64], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "LSTM", "name": "lstm_1", "config": {"recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "activity_regularizer": null, "unit_forget_bias": true, "units": 128, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_regularizer": null, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "activation": "tanh", "return_sequences": true, "implementation": 1, "bias_regularizer": null, "use_bias": true, "stateful": false, "kernel_constraint": null, "kernel_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_2", "config": {"recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0, "activity_regularizer": null, "unit_forget_bias": true, "units": 64, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_regularizer": null, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "activation": "tanh", "return_sequences": true, "implementation": 1, "bias_regularizer": null, "use_bias": true, "stateful": false, "kernel_constraint": null, "kernel_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "trainable": true, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"class_name": "Multiply", "name": "multiply_1", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"seed": null, "name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_2", "trainable": true, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "units": 5611, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}}, "training_config": {"metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "amsgrad": false, "beta_1": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07, "lr": 6.45753534627147e-05}}, "loss": "sparse_categorical_crossentropy", "loss_weights": null}}, "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "shape": [64, 1], "dtype": "float32", "quantization": {"min": -0.2969671413251262, "scale": 9.152940093238594e-06, "dtype": "uint16"}}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.0, "scale": 1.0, "dtype": "uint16"}}, {"name": "dense_2/kernel", "shape": [2048, 5611], "dtype": "float32", "quantization": {"min": -1.8803872795938816, "scale": 6.179589469236195e-05, "dtype": "uint16"}}, {"name": "dense_2/bias", "shape": [5611], "dtype": "float32", "quantization": {"min": -1.149069031919996, "scale": 3.312106280575321e-05, "dtype": "uint16"}}, {"name": "lstm_1/kernel", "shape": [64, 512], "dtype": "float32", "quantization": {"min": -2.1475821232462837, "scale": 5.626066549424404e-05, "dtype": "uint16"}}, {"name": "lstm_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.2308197852666076, "scale": 3.5164270192177806e-05, "dtype": "uint16"}}, {"name": "lstm_1/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.4765491219800916, "scale": 3.20606244604475e-05, "dtype": "uint16"}}, {"name": "lstm_2/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"min": -1.1962372182408196, "scale": 3.857834166153314e-05, "dtype": "uint16"}}, {"name": "lstm_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -1.0634795126366, "scale": 3.4045507335422733e-05, "dtype": "uint16"}}, {"name": "lstm_2/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.4663405033019021, "scale": 2.6782707517913054e-05, "dtype": "uint16"}}], "paths": ["group1-shard1of6", "group1-shard2of6", "group1-shard3of6", "group1-shard4of6", "group1-shard5of6", "group1-shard6of6"]}]}