{"modelTopology": {"training_config": {"loss_weights": null, "metrics": ["sparse_categorical_accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "beta_1": 0.8999999761581421, "decay": 0.0, "lr": 7.490943971788511e-05, "epsilon": 1e-07, "beta_2": 0.9990000128746033}}, "loss": "sparse_categorical_crossentropy", "sample_weight_mode": null}, "model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 12, 120], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Masking", "name": "masking_1", "config": {"mask_value": 0.0, "trainable": true, "name": "masking_1"}}, {"inbound_nodes": [[["masking_1", 0, 0, {}]]], "class_name": "Bidirectional", "name": "bidirectional_1", "config": {"merge_mode": "concat", "name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"units": 24, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "return_sequences": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "unroll": false, "use_bias": true, "recurrent_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "name": "lstm_1", "return_state": false, "bias_regularizer": null}}}}, {"inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"seed": null, "rate": 0.2, "noise_shape": null, "trainable": true, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_1", "config": {"name": "multiply_1", "trainable": true}}, {"inbound_nodes": [[["multiply_1", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_1", "config": {"output_shape_type": "raw", "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxMAAAB0AABqAQB8AABkAQBkAgCDAQFTKQNO2gRheGlz6QEA\nAAApAtoBS9oDc3VtKQHaAXipAHIGAAAA+gtybm5zdHVjay5wedoIPGxhbWJkYT7vAAAAcwAAAAA=\n", null, null]}}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2", "config": {"seed": null, "rate": 0.2, "noise_shape": null, "trainable": true, "name": "dropout_2"}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"units": 5982, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}}, "keras_version": "2.1.6", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [120, 96], "name": "bidirectional_1/forward_lstm_1/kernel", "quantization": {"min": -2.224633725884396, "dtype": "uint16", "scale": 6.226409151905724e-05}}, {"dtype": "float32", "shape": [24, 96], "name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "quantization": {"min": -1.8980869834006693, "dtype": "uint16", "scale": 5.347778388416503e-05}}, {"dtype": "float32", "shape": [96], "name": "bidirectional_1/forward_lstm_1/bias", "quantization": {"min": -0.13552151374820715, "dtype": "uint16", "scale": 1.9247481003864103e-05}}, {"dtype": "float32", "shape": [120, 96], "name": "bidirectional_1/backward_lstm_1/kernel", "quantization": {"min": -1.8331512047077214, "dtype": "uint16", "scale": 5.514397631705085e-05}}, {"dtype": "float32", "shape": [24, 96], "name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "quantization": {"min": -2.202058431403155, "dtype": "uint16", "scale": 6.755194893561431e-05}}, {"dtype": "float32", "shape": [96], "name": "bidirectional_1/backward_lstm_1/bias", "quantization": {"min": -0.13494739337244688, "dtype": "uint16", "scale": 2.0754751364571958e-05}}, {"dtype": "float32", "shape": [48, 1], "name": "dense_1/kernel", "quantization": {"min": -0.3424902593865769, "dtype": "uint16", "scale": 1.0417954658146826e-05}}, {"dtype": "float32", "shape": [1], "name": "dense_1/bias", "quantization": {"min": 0.0, "dtype": "uint16", "scale": 1.0}}, {"dtype": "float32", "shape": [48, 5982], "name": "dense_2/kernel", "quantization": {"min": -1.1450282794619584, "dtype": "uint16", "scale": 3.517643941697516e-05}}, {"dtype": "float32", "shape": [5982], "name": "dense_2/bias", "quantization": {"min": -2.701964365827543, "dtype": "uint16", "scale": 0.00010891504215686647}}]}]}