{"modelTopology": {"model_config": {"class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 64], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"name": "lstm_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"activation": "tanh", "bias_constraint": null, "return_sequences": true, "bias_regularizer": null, "name": "lstm_1", "return_state": false, "implementation": 1, "recurrent_constraint": null, "unroll": false, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 200, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_regularizer": null, "go_backwards": false, "kernel_regularizer": null}}, {"name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"activation": "tanh", "bias_constraint": null, "return_sequences": false, "bias_regularizer": null, "name": "lstm_2", "return_state": false, "implementation": 1, "recurrent_constraint": null, "unroll": false, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 200, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_regularizer": null, "go_backwards": false, "kernel_regularizer": null}}, {"name": "dropout_1", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "units": 5597, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}], "input_layers": [["input_1", 0, 0]]}}, "training_config": {"sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "lr": 0.0015999999595806003, "rho": 0.8999999761581421, "decay": 0.0}}, "loss": "sparse_categorical_crossentropy", "metrics": ["sparse_categorical_accuracy"]}, "keras_version": "2.2.4", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_1/kernel", "shape": [200, 5597], "quantization": {"min": -5.975876474762487, "scale": 0.00018877547620553724, "dtype": "uint16"}, "dtype": "float32"}, {"name": "dense_1/bias", "shape": [5597], "quantization": {"min": -6.885352898495343, "scale": 0.00012609150823161087, "dtype": "uint16"}, "dtype": "float32"}, {"name": "lstm_1/kernel", "shape": [64, 800], "quantization": {"min": -1.0219290223394133, "scale": 2.9746151137808563e-05, "dtype": "uint16"}, "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [200, 800], "quantization": {"min": -1.0556843474517565, "scale": 3.0645736978975746e-05, "dtype": "uint16"}, "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [800], "quantization": {"min": -0.23902342342135288, "scale": 2.1161879010301273e-05, "dtype": "uint16"}, "dtype": "float32"}, {"name": "lstm_2/kernel", "shape": [200, 800], "quantization": {"min": -0.8862023335168207, "scale": 2.620582350642637e-05, "dtype": "uint16"}, "dtype": "float32"}, {"name": "lstm_2/recurrent_kernel", "shape": [200, 800], "quantization": {"min": -0.660551877596417, "scale": 2.1263540241313924e-05, "dtype": "uint16"}, "dtype": "float32"}, {"name": "lstm_2/bias", "shape": [800], "quantization": {"min": -0.2762268579660132, "scale": 2.2699224091216467e-05, "dtype": "uint16"}, "dtype": "float32"}]}]}